{
    "routine": "10 minutos - Cuerpo Completo",
    "total_time": 600,
    "notes": "Antes de empezar, dedica al menos 1 minuto a movilizar tus articulaciones y realizar estiramientos dinámicos (rotaciones de hombros, cadera, tobillos, etc.).",
    "image": "img/full_body_10.png",
    "description": "Esta rutina de 10 minutos se enfoca en trabajar varios grupos musculares de forma rápida y efectiva. Incluye ejercicios de tren inferior, superior y core, con descansos cortos entre cada intervalo.",
    "exercises": [
      {
        "name": "Jumping Jacks",
        "duration": 45,
        "rest": 15,
        "instructions": "Realiza saltos abriendo y cerrando las piernas a la vez que llevas los brazos por encima de la cabeza. Mantén el abdomen contraído."
      },
      {
        "name": "Push-Ups (Flexiones)",
        "duration": 45,
        "rest": 15,
        "instructions": "Mantén el cuerpo en línea recta desde los hombros hasta los talones. Baja el pecho hacia el suelo sin arquear la espalda."
      },
      {
        "name": "Sentadillas (Squats)",
        "duration": 45,
        "rest": 15,
        "instructions": "Separa los pies a la altura de los hombros. Baja llevando la cadera hacia atrás, manteniendo la espalda recta."
      },
      {
        "name": "Plancha Lateral Alternada",
        "duration": 45,
        "rest": 15,
        "instructions": "Comienza en plancha alta. Gira el cuerpo hacia un lado levantando el brazo y mantén la posición unos segundos. Alterna al otro lado."
      },
      {
        "name": "Puente de Glúteos (Glute Bridge)",
        "duration": 45,
        "rest": 15,
        "instructions": "Túmbate boca arriba con las rodillas flexionadas y pies apoyados en el suelo. Eleva la cadera hasta alinear rodillas, cadera y hombros."
      },
      {
        "name": "Mountain Climbers",
        "duration": 45,
        "rest": 15,
        "instructions": "En posición de plancha alta, lleva las rodillas hacia el pecho de forma alternada, manteniendo la cadera lo más estable posible."
      },
      {
        "name": "Estocadas Alternadas (Lunges)",
        "duration": 45,
        "rest": 15,
        "instructions": "Da un paso adelante con una pierna y baja la rodilla trasera casi hasta el suelo. Alterna con la otra pierna."
      },
      {
        "name": "Plancha con Toque de Hombro (Shoulder Taps)",
        "duration": 45,
        "rest": 15,
        "instructions": "Mantén posición de plancha alta, lleva una mano al hombro opuesto y luego la otra, evitando balancear la cadera."
      },
      {
        "name": "Curl de Bíceps (con Mancuernas o Botellas)",
        "duration": 45,
        "rest": 15,
        "instructions": "Mantén los codos pegados al cuerpo y controla el movimiento al subir y bajar."
      },
      {
        "name": "Bicicleta Abdominal (Bicycle Crunch)",
        "duration": 45,
        "rest": 15,
        "instructions": "Túmbate boca arriba, coloca las manos detrás de la cabeza y lleva el codo derecho hacia la rodilla izquierda mientras estiras la otra pierna. Alterna el movimiento con el otro lado."
      }
    ]
  }
  